load_test_results/POST__pullRequest_merge_20251116_220657.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Finished 250 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /pullRequest/merge
Document Length:        34 bytes

Concurrency Level:      5
Time taken for tests:   0.034 seconds
Complete requests:      250
Failed requests:        0
Non-2xx responses:      250
Total transferred:      39250 bytes
Total body sent:        49500
HTML transferred:       8500 bytes
Requests per second:    7406.31 [#/sec] (mean)
Time per request:       0.675 [ms] (mean)
Time per request:       0.135 [ms] (mean, across all concurrent requests)
Transfer rate:          1135.54 [Kbytes/sec] received
                        1432.08 kb/s sent
                        2567.62 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       0
Processing:     0    1   0.1      0       1
Waiting:        0    1   0.1      0       1
Total:          0    1   0.1      1       1
ERROR: The median and mean for the processing time are more than twice the standard
       deviation apart. These results are NOT reliable.
ERROR: The median and mean for the waiting time are more than twice the standard
       deviation apart. These results are NOT reliable.

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      1
  90%      1
  95%      1
  98%      1
  99%      1
 100%      1 (longest request)