load_test_results/POST__users_setIsActive_20251116_220657.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Finished 250 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /users/setIsActive
Document Length:        102 bytes

Concurrency Level:      5
Time taken for tests:   0.057 seconds
Complete requests:      250
Failed requests:        239
   (Connect: 0, Receive: 0, Length: 239, Exceptions: 0)
Non-2xx responses:      239
Total transferred:      39844 bytes
Total body sent:        49500
HTML transferred:       9248 bytes
Requests per second:    4402.26 [#/sec] (mean)
Time per request:       1.136 [ms] (mean)
Time per request:       0.227 [ms] (mean, across all concurrent requests)
Transfer rate:          685.17 [Kbytes/sec] received
                        851.22 kb/s sent
                        1536.39 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       0
Processing:     0    1   0.9      1       7
Waiting:        0    1   0.9      1       7
Total:          0    1   1.0      1       8

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      1
  90%      1
  95%      1
  98%      5
  99%      7
 100%      8 (longest request)